{
  "HOME": {
    "TITLE": "YOUR LEAGUES",
    "NO_LEAGUES": "You don't have any leagues yet. Create one or join an existing one!",
    "CREATE_LEAGUE": "Create League",
    "JOIN_LEAGUE": "Join",
    "INVITE_USERS": "Invite Users",
    "NEW_EDITION": "New Edition",
    "VIEW_DETAILS": "View Details",
    "NEW_LEAGUES": "New leagues",
    "CREATE_NEW_LEAGUE": "Create a new league",
    "JOIN_EXISTING_LEAGUE": "Join an existing league",
    "YEAR": "Year"
  },
  "HEADER": {
    "LOGOUT": "Logout",
    "ADMIN_AREA": "Admin Area",
    "HOME": "Back to Home",
    "BACK_TO_HOME": "Back to Home"
  },
  "BANNER": {
    "RULES": "RULES",
    "TROPHIES": "TROPHIES",
    "PROFILE": "PROFILE"
  },
  "PROFILE": {
    "TITLE": "Your Profile",
    "NICKNAME": "Nickname:",
    "FAVORITE_TEAM": "Favorite Team:",
    "SEARCH_TEAM": "Search your team...",
    "CANCEL": "Cancel",
    "SAVE": "Save Profile",
    "SAVING": "Saving...",
    "SUCCESS": "Profile saved successfully! 🎉",
    "ERROR": "❌ Error saving. Please retry.",
    "DELETE_ACCOUNT": "Delete Account",
    "NICKNAME_REQUIRED": "Enter a valid nickname",
    "DELETE_DIALOG_TITLE": "Delete Account",
    "DELETE_DIALOG_MESSAGE": "If you delete your account, all your personal data and your profile will be deleted <strong>permanently</strong>.",
    "DELETE_DIALOG_CONFIRM": "Are you sure you want to proceed?",
    "DELETE_DIALOG_CANCEL": "Cancel",
    "DELETE_DIALOG_DELETE": "Yes, delete my account",
    "DELETE_DIALOG_DELETING": "Deleting..."
  },
  "TROPHIES": {
    "TITLE": "Hall of Fame",
    "YOUR_TROPHIES": "Your Trophies",
    "NO_TROPHIES_YET": "No trophies yet!",
    "NO_TROPHIES_MESSAGE": "You haven't won any league yet.",
    "NO_TROPHIES_SUBTITLE": "Keep playing and you'll be the next champion!",
    "SEASON": "Season",
    "FIRST_PLACE": "1st Place",
    "ROUNDS_SURVIVED": "Rounds Survived",
    "FINAL_TEAM": "Final Team",
    "YOUR_STATS": "YOUR STATISTICS",
    "TOURNAMENTS_PLAYED": "Tournaments Played",
    "VICTORIES": "Victories",
    "PODIUMS": "Podiums",
    "TOTAL_ROUNDS": "Total Rounds",
    "WIN_RATE": "Win Rate %",
    "FUNNY_MESSAGES": {
      "MSG_1": "Luck wasn't on your side this time! 🎲",
      "SUB_1": "But don't worry, there are always more games!",
      "MSG_2": "Oops! You've been eliminated! 😅",
      "SUB_2": "No worries, next time you'll be luckier!",
      "MSG_3": "Not everyone can win all the time! 🤷",
      "SUB_3": "Maybe next time will be the one!",
      "MSG_4": "You lost, but you played with style! 😎",
      "SUB_4": "Your class is undeniable, the victory... not so much!",
      "MSG_5": "The fastest survivor in the west! 🤠",
      "SUB_5": "Home before it even started!",
      "MSG_6": "Houston, we have a problem! 🚀",
      "SUB_6": "And the problem is you're already out!",
      "MSG_7": "Didn't even have time to warm up! 🥶",
      "SUB_7": "Eliminated before breaking a sweat!",
      "MSG_8": "Your strategy? Lose immediately! 🎯",
      "SUB_8": "Mission accomplished successfully!",
      "MSG_9": "Negative record established! 📉",
      "SUB_9": "No one has ever lost this fast!",
      "MSG_10": "You're the king... of eliminations! 👑",
      "SUB_10": "You have a unique talent for getting eliminated!",
      "MSG_11": "You made a fool of yourself! 🐌",
      "SUB_11": "But at least you're funny!",
      "MSG_12": "You're the tournament clown! 🤡",
      "SUB_12": "But at least you make the other participants laugh.",
      "MSG_13": "You cleaned house... of yourself! 🧹",
      "SUB_13": "Often eliminated, never a winner. What a record!",
      "MSG_14": "Even a snail would've arrived before you! 🐌",
      "SUB_14": "And probably would've won something too.",
      "MSG_15": "Welcome to the elimination circus! 🎪",
      "SUB_15": "You're the main attraction: always part of the eliminations!",
      "MSG_16": "Your victories are in the freezer... since 1800! 🧊",
      "SUB_16": "Frozen so well that no one will ever find them.",
      "MSG_17": "Not even a bone of victory to chew on! 🦴",
      "SUB_17": "Your dog would have better luck than you."
    }
  },
  "RULES": {
    "TITLE": "Survivor Rules",
    "SECTION_1_TITLE": "1. Weekly Choice",
    "SECTION_1_P1": "Each player can choose only one team for each game round.",
    "SECTION_1_P2": "The option to make the choice public or private will be available exclusively through the app. In the current version of the game, all choices are public and visible to other participants from the moment of confirmation.",
    "SECTION_2_TITLE": "2. Non-repeatable Teams",
    "SECTION_2_TEXT": "During the same tournament, it is not possible to choose the same team twice, even in different rounds.",
    "SECTION_3_TITLE": "3. Elimination",
    "SECTION_3_TEXT": "If the chosen team loses or draws their match, the player is eliminated from the tournament.",
    "SECTION_4_TITLE": "4. Tournament Duration",
    "SECTION_4_P1": "The tournament ends when:",
    "SECTION_4_L1": "only one active player remains, who is declared the winner;",
    "SECTION_4_L2": "or 10 valid game rounds are completed.",
    "SECTION_4_P2": "In case of termination due to round limit, the prize pool is divided equally among the remaining active players.",
    "SECTION_5_TITLE": "5. Choice Timing",
    "SECTION_5_P1": "Choices must be made within 15 minutes before the start of the Serie A round.",
    "SECTION_5_P2": "After the start of the first match of the round, no choice can be modified.",
    "SECTION_6_TITLE": "6. Calendar",
    "SECTION_6_TEXT": "Game rounds refer exclusively to the official Serie A calendar.",
    "SECTION_7_TITLE": "7. Total Elimination and Prize Pool Equity",
    "SECTION_7_P1": "If, at the end of a valid round, all remaining players lose or draw, the tournament ends immediately.",
    "SECTION_7_P2": "In this case, the prize pool is divided equally among the players remaining in the game for that round.",
    "SECTION_7_P3": "The prize pool is generated exclusively by tournament participants and cannot be assigned to external or substitute players, to ensure equal conditions.",
    "SECTION_8_TITLE": "8. Early Prize Pool Division",
    "SECTION_8_P1": "When the number of remaining players is equal to or less than 10% of the initial participants, active players can decide to divide the entire prize pool equally in advance.",
    "SECTION_8_P2": "The decision is made by majority vote.",
    "SECTION_8_EXAMPLE_TITLE": "Example:",
    "SECTION_8_EXAMPLE": "Tournament with 72 participants → 10% = 7 players. If 7 or fewer players remain, it is possible to vote on the prize pool division; with a favorable majority vote, the prize pool is divided.",
    "SECTION_8_P3": "Furthermore, if the remaining players (≤10%) remain the same for three consecutive rounds without any elimination, the prize pool is automatically divided among them.",
    "SECTION_9_TITLE": "9. Rounds with Postponed or Suspended Matches",
    "SECTION_9_1_TITLE": "9.1 Postponement Before the Start of the Round",
    "SECTION_9_1_P1": "If one or more Serie A matches are postponed before the start of the round and are not played before the start of the next round (for example due to Supercoppa or extraordinary events):",
    "SECTION_9_1_L1": "the round is considered neutral for Survivor purposes;",
    "SECTION_9_1_L2": "no player is required to make a choice;",
    "SECTION_9_1_L3": "no player is eliminated;",
    "SECTION_9_1_L4": "the round is not counted in the total tournament rounds;",
    "SECTION_9_1_L5": "the tournament continues regularly with the next round;",
    "SECTION_9_1_L6": "the results of postponed matches, when rescheduled, do not produce retroactive effects.",
    "SECTION_9_2_TITLE": "9.2 Postponement or Suspension After the Start of the Round",
    "SECTION_9_2_P1": "If one or more matches are postponed or suspended after the round has started, after:",
    "SECTION_9_2_L1": "choices have been made;",
    "SECTION_9_2_L2": "at least one match of the round has already started;",
    "SECTION_9_2_P2": "then:",
    "SECTION_9_2_L3": "players who chose a team involved in the postponement or suspension remain active;",
    "SECTION_9_2_L4": "their choice is considered winning for tournament purposes;",
    "SECTION_9_2_L5": "the chosen team is still considered used and cannot be selected in subsequent rounds.",
    "SECTION_9_2_P3": "For all other players, the standard rules apply: the outcome of the round depends exclusively on the result of the chosen team.",
    "GOOD_LUCK": "Good luck, Survivor! 🍀"
  },
  "DIALOGS": {
    "CLOSE": "Close",
    "CONFIRM": "Confirm",
    "CANCEL": "Cancel",
    "DELETE": "Delete",
    "SAVE": "Save",
    "LOADING": "Loading...",
    "FAQ_TITLE": "Frequently Asked Questions",
    "CONTACT_TITLE": "Contact",
    "CONTACT_INTRO": "For information, suggestions or reports, contact us via email:",
    "CONTACT_EMAIL": "For information, suggestions or reports, contact us via email:",
    "TERMS_TITLE": "Terms and Conditions",
    "PRIVACY_TITLE": "Privacy Policy",
    "ABOUT_TITLE": "About Us",
    "ABOUT_TEXT": "Survivor is a competitive gaming platform where you can challenge your friends in exciting sports tournaments!",
    "ABOUT_INTRO_1": "<strong>Survivor</strong> is an entertainment app dedicated to fans of <strong>Serie A</strong>, <strong>Tennis</strong> and <strong>Basketball</strong>.",
    "ABOUT_INTRO_2": "Our mission is to offer fun, simple and accessible games and tournaments for everyone.",
    "ABOUT_INTRO_3": "We are a small team passionate about sports and technology, and we believe in fair play and honest competition.",
    "ABOUT_NOTICE": "Survivor is an entertainment game with no monetary prizes. For information on how we handle data and game rules, please refer to our",
    "ABOUT_TERMS_LINK": "Terms and Conditions",
    "ABOUT_AND": "and",
    "ABOUT_PRIVACY_LINK": "Privacy Policy",
    "ABOUT_CONTACT": "For questions or support, write to us at:",
    "TERMS_HEADING": "Terms and Conditions of Use",
    "TERMS_SUBTITLE": "Survivor",
    "TERMS_1_TITLE": "1. Service Purpose",
    "TERMS_1_TEXT": "Survivor is a digital entertainment platform that allows users to participate in games and tournaments based on sports choices and competitive dynamics. The service does not constitute gambling or betting activities.",
    "TERMS_2_TITLE": "2. Registration and Account",
    "TERMS_2_TEXT_1": "To use Survivor, you must create an account via email. The user is responsible for the accuracy of the information provided and the use of their account.",
    "TERMS_2_TEXT_2": "Only one account is allowed per user. Creating multiple accounts or using automated systems is prohibited.",
    "TERMS_3_TITLE": "3. Service Use",
    "TERMS_3_TEXT": "The user agrees to use Survivor correctly and in accordance with these conditions. Behaviors that could compromise the proper functioning of the platform are prohibited, including attempts to manipulate results or rankings.",
    "TERMS_4_TITLE": "4. Game Rules",
    "TERMS_4_TEXT": "The rules of games and tournaments are defined within the app and may be modified at any time. Results generated by the platform are considered final and not contestable.",
    "TERMS_5_TITLE": "5. Prizes",
    "TERMS_5_TEXT": "Survivor does not provide monetary prizes. Any prizes, recognitions or trophies have exclusively symbolic or promotional value.",
    "TERMS_6_TITLE": "6. Account Suspension and Closure",
    "TERMS_6_TEXT": "The manager reserves the right to suspend or close a user's account, without notice, in case of violation of these conditions or improper use of the service.",
    "TERMS_7_TITLE": "7. Limitation of Liability",
    "TERMS_7_TEXT_1": "The service is provided \"as is\". The manager does not guarantee the absence of errors, interruptions or malfunctions and is not responsible for any damages arising from the use of the platform.",
    "TERMS_7_TEXT_2": "The manager is not responsible for any inaccuracies in sports data provided by external sources.",
    "TERMS_8_TITLE": "8. Intellectual Property",
    "TERMS_8_TEXT": "All content on Survivor, including texts, graphics, logos and platform structure, is the property of the manager and cannot be used without authorization.",
    "TERMS_9_TITLE": "9. Changes to Terms",
    "TERMS_9_TEXT": "These Terms and Conditions may be updated or modified at any time. Changes will be effective upon their publication on the platform.",
    "TERMS_10_TITLE": "10. Applicable Law and Competent Forum",
    "TERMS_10_TEXT": "These Terms and Conditions are governed by Italian law. For any dispute, the court of the place of residence or headquarters of the manager has exclusive jurisdiction.",
    "TERMS_11_TITLE": "11. Contact",
    "TERMS_11_TEXT": "For information or requests, you can contact the manager at the email address:",
    "PRIVACY_HEADING": "Privacy Policy",
    "PRIVACY_SUBTITLE": "Survivor",
    "PRIVACY_INTRO": "This Privacy Policy describes how personal data of users using the Survivor platform (hereinafter \"Service\") is collected, used and protected, in accordance with EU Regulation 2016/679 (GDPR).",
    "PRIVACY_1_TITLE": "1. Data Controller",
    "PRIVACY_1_TEXT_1": "The data controller is the manager of the Survivor platform.",
    "PRIVACY_1_TEXT_2": "For any request regarding this Privacy Policy, you can contact the controller at the email address:",
    "PRIVACY_2_TITLE": "2. Personal Data Collected",
    "PRIVACY_2_TEXT": "Personal data collected through the use of the Service is limited to what is strictly necessary for its operation:",
    "PRIVACY_2_ITEM_1": "Email address (used for authentication via magic link)",
    "PRIVACY_2_ITEM_2": "User-chosen nickname",
    "PRIVACY_2_ITEM_3": "Sports preference (favorite team)",
    "PRIVACY_2_ITEM_4": "Technical data on Service usage (logs, device and access information)",
    "PRIVACY_3_TITLE": "3. Purpose of Processing",
    "PRIVACY_3_TEXT": "Personal data is processed for the following purposes:",
    "PRIVACY_3_ITEM_1": "Allow registration and access to the Service",
    "PRIVACY_3_ITEM_2": "Enable participation in games and tournaments",
    "PRIVACY_3_ITEM_3": "Manage platform features and rankings",
    "PRIVACY_3_ITEM_4": "Ensure the security and proper functioning of the Service",
    "PRIVACY_3_ITEM_5": "Comply with any legal obligations",
    "PRIVACY_4_TITLE": "4. Legal Basis for Processing",
    "PRIVACY_4_TEXT": "Personal data processing is carried out based on:",
    "PRIVACY_4_ITEM_1": "The execution of the contract of which the user is a party (use of the Service)",
    "PRIVACY_4_ITEM_2": "The legitimate interest of the controller in the security and improvement of the platform",
    "PRIVACY_5_TITLE": "5. Processing Methods",
    "PRIVACY_5_TEXT_1": "Data processing is carried out using IT and telematic tools, in compliance with the principles of lawfulness, fairness, transparency and data minimization.",
    "PRIVACY_5_TEXT_2": "Adequate security measures are adopted to protect personal data from unauthorized access, loss or unlawful use.",
    "PRIVACY_6_TITLE": "6. Data Retention",
    "PRIVACY_6_TEXT_1": "Personal data is retained for the time necessary to provide the Service.",
    "PRIVACY_6_TEXT_2": "The user can request the deletion of their account and associated data at any time.",
    "PRIVACY_7_TITLE": "7. Data Communication and Disclosure",
    "PRIVACY_7_TEXT_1": "Personal data is not sold or transferred to third parties.",
    "PRIVACY_7_TEXT_2": "Data may be processed by technical service providers (e.g. hosting or email services) exclusively for purposes related to the operation of the Service.",
    "PRIVACY_8_TITLE": "8. Aggregate and Anonymous Data",
    "PRIVACY_8_TEXT_1": "The controller may process data in aggregate and anonymous form for statistical purposes and analysis of platform usage.",
    "PRIVACY_8_TEXT_2": "Such data does not allow identification of users in any way.",
    "PRIVACY_9_TITLE": "9. User Rights",
    "PRIVACY_9_TEXT": "The user has the right to:",
    "PRIVACY_9_ITEM_1": "Access their personal data",
    "PRIVACY_9_ITEM_2": "Request its rectification or deletion",
    "PRIVACY_9_ITEM_3": "Object to or limit its processing, in cases provided by law",
    "PRIVACY_9_TEXT_2": "Requests can be sent to the email address:",
    "PRIVACY_10_TITLE": "10. Minors",
    "PRIVACY_10_TEXT_1": "The Service is reserved for users who have completed at least 14 years of age.",
    "PRIVACY_10_TEXT_2": "By registering, the user declares to meet the required age requirements.",
    "PRIVACY_11_TITLE": "11. Cookies",
    "PRIVACY_11_TEXT_1": "The web app may use technical cookies necessary for the proper functioning of the Service.",
    "PRIVACY_11_TEXT_2": "Profiling cookies are not used without the user's consent.",
    "PRIVACY_12_TITLE": "12. Changes to Privacy Policy",
    "PRIVACY_12_TEXT_1": "This Privacy Policy may be updated at any time.",
    "PRIVACY_12_TEXT_2": "Changes will be effective upon their publication on the platform."
  },
  "LEAGUE": {
    "LEAGUE_DETAILS": "League details",
    "EDITION": "Edition",
    "STATUS": {
      "ACTIVE": "Active",
      "COMPLETED": "Completed",
      "UPCOMING": "Upcoming"
    },
    "ROLE": {
      "LEADER": "Leader",
      "PLAYER": "Player"
    },
    "ROUND": "Round",
    "NEXT_ROUND": "Next Round",
    "CURRENT_ROUND": "Current",
    "YOUR_ROLE": "Your Role",
    "LEAGUE_STATE": "League Status",
    "CALCULATED_ROUND": "Calculated Round",
    "NEXT_CHAMPIONSHIP_ROUND": "Next Championship Round",
    "TIME_EXPIRED": "Time Expired",
    "REOPEN": "Reopen",
    "SECOND_CHANCE": "2nd CHANCE",
    "YOU_ELIMINATED": "YOU'VE BEEN ELIMINATED!",
    "YOU_BETRAYED": "Betrayed by:",
    "CONSOLATION_MSG": "Not everyone can win, but you played with style! 😎",
    "ROUND_COMPLETED": "Completed",
    "ROUND_IN_PROGRESS": "In Progress",
    "TO_PLAY": "To Play",
    "SUSPENDED": "Suspended",
    "PLAY_NOW": "Play Now",
    "WEEK": "Week",
    "DELETE_PLAYER": "Remove player",
    "DELETE_LEAGUE": "Delete this league",
    "ENTER_LEAGUE": "Enter league",
    "INITIAL_ROUND": "Initial round",
    "NUM_MEMBERS": "Members",
    "WITH_PASSWORD": "Password protected",
    "CLOSING_IN": "Closing in",
    "NEXT_START": "Next start",
    "CALCULATE": "Calculate",
    "SUSPENSIONS": "Suspensions",
    "INVITE": "Invite",
    "LAST_MATCHES": "Last",
    "LAST_ENCOUNTERS": "Last encounters",
    "NEXT_MATCHES": "Next",
    "NEXT_GAMES": "Next games",
    "SEARCH_PLAYER": "Search player...",
    "SEARCH_TEAM": "Search team...",
    "HEAD_TO_HEAD": "Head to head",
    "CONSOLATION": {
      "1": "Luck wasn't on your side... but you can always cheer for those still in the game! 🍀",
      "2": "Not everyone can win, but you played with style! 😎",
      "3": "Next time will be better, I promise! 💪",
      "4": "You gave it your all, that's what counts! 🌟",
      "5": "Better eliminated with honor than winner by chance! 🎖️",
      "6": "Bad luck got you, but you're a champion! 🏆",
      "7": "Don't cry, there's always the next edition! 😢➡️😊",
      "8": "You lost the battle, but not the war! ⚔️",
      "9": "Statistics say you'll win eventually... maybe! 📊😅",
      "10": "At least now you can sleep peacefully on Sundays! 😴",
      "11": "Take comfort: you did better than those who didn't even try! 💫",
      "12": "The wheel turns, next time it'll be your turn! 🎡",
      "13": "You challenged fate and... well, you lost! But what courage! 🦁",
      "14": "You weren't eliminated, you were promoted to VIP spectator! 🎭",
      "15": "Defeat is temporary, glory is eternal... or almost! ✨",
      "16": "You picked the wrong team, it happens! 🤷",
      "17": "Your name will remain in history... of your family! 📜",
      "18": "Better to have been and been eliminated than never to have been! 🤔",
      "19": "Your elimination is art, pure tragic art! 🎨",
      "20": "You lost, but at least you have a great story to tell! 📖"
    },
    "CONFIRM_DELETE_TITLE": "Delete League",
    "CONFIRM_DELETE_MESSAGE": "Are you sure you want to delete this league? This action is irreversible and all league data will be permanently deleted.",
    "CONFIRM_DELETE_CANCEL": "Cancel",
    "CONFIRM_DELETE_CONFIRM": "Yes, delete",
    "CONFIRM_DELETE_DELETING": "Deleting..."
  },
  "COMMON": {
    "CLOSE": "Close",
    "SAVE": "Save",
    "CANCEL": "Cancel",
    "DELETE": "Delete",
    "EDIT": "Edit",
    "CONFIRM": "Confirm",
    "LOADING": "Loading...",
    "ERROR": "Error",
    "SUCCESS": "Success",
    "YES": "Yes",
    "NO": "No",
    "OK": "OK",
    "COMING_SOON": "Coming Soon",
    "REQUIRED": "required",
    "AND": "and",
    "ADD": "Add",
    "SEND_INVITES": "Send Invites",
    "COPY_LINK": "Copy link",
    "COPIED": "Copied!",
    "REFRESH": "Refresh"
  },
  "SERVICE_UNAVAILABLE": {
    "TITLE": "Service Unavailable",
    "HEADING": "Service temporarily unavailable",
    "MESSAGE": "The backend service is currently unreachable. Please try again later or press Refresh to retry."
  },
  "ADMIN": {
    "TITLE": "Admin Area",
    "DASHBOARD": "Administrator Dashboard",
    "PROFILE": "Profile",
    "PROFILE_FE_MOBILE": "FE / Mobile Profile",
    "CALENDAR_URL": "Calendar URL",
    "LEAGUES_MANAGEMENT": "Leagues Management",
    "LEAGUES_DESCRIPTION": "Create and manage system leagues",
    "USERS_MANAGEMENT": "Users Management",
    "USERS_DESCRIPTION": "View and manage users",
    "CHAMPIONSHIPS_MANAGEMENT": "Championships Management",
    "CHAMPIONSHIPS_DESCRIPTION": "Configure championships and teams",
    "STATISTICS": "Statistics",
    "STATISTICS_DESCRIPTION": "View system statistics"
  },
  "FOOTER": {
    "LANGUAGE": "Language",
    "ITALIAN": "Italiano",
    "ENGLISH": "English",
    "COPYRIGHT": "© 2026 Survivor DDL",
    "TERMS": "Terms and Conditions",
    "PRIVACY": "Privacy Policy",
    "FAQ": "FAQ",
    "ABOUT": "About Us",
    "CONTACT": "Contact"
  },
  "AUTH": {
    "LOGIN_TITLE": "Login",
    "LOGIN_SUBTITLE": "Enter your email to receive the magic link",
    "EMAIL_LABEL": "Email",
    "EMAIL_PLACEHOLDER": "Enter email address (e.g. user@example.com)",
    "EMAIL_REQUIRED": "Email is required",
    "EMAIL_INVALID": "Enter a valid email",
    "SEND_MAGIC_LINK": "Send Magic Link",
    "CHECK_EMAIL": "Check your email!",
    "MAGIC_LINK_SENT": "We've sent you a login link",
    "CLICK_LINK": "Click the link in the email to sign in",
    "TERMS_DECLARATION": "I declare that I have read and accepted the",
    "AGE_DISCLAIMER": "The application is intended exclusively for users aged 14 or over."
  },
  "CREATE_LEAGUE": {
    "TITLE": "Create New League",
    "LEAGUE_NAME": "League Name",
    "LEAGUE_NAME_PLACEHOLDER": "Enter league name",
    "SPORT": "Sport",
    "CHAMPIONSHIP": "Championship",
    "SELECT_CHAMPIONSHIP": "Select a championship",
    "INITIAL_ROUND": "Initial round",
    "INITIAL_ROUND_ERROR": "Initial round must be between",
    "PASSWORD": "Password to join",
    "PASSWORD_PLACEHOLDER": "Enter a password (optional)",
    "WITH_PASSWORD": "Password protected",
    "CREATE_BUTTON": "Create League",
    "SUCCESS_MESSAGE": "League <b>{{name}}</b> has been created successfully.",
    "SHARE_URL": "You can tell your friends to find the league at the URL",
    "INVITE_EMAIL": "Invite friends via email",
    "EMAIL_PLACEHOLDER": "email@example.com",
    "CHAMPIONSHIP_ENDED": "Unfortunately the championship has ended",
    "WITH_PASSWORD_JOIN": "and join with password"
  },
  "JOIN_LEAGUE": {
    "TITLE": "Join a League",
    "CONFIRM_TITLE": "Confirm subscription",
    "CONFIRM_MESSAGE": "Do you want to join the league <strong>{{name}}</strong>?",
    "CHAMPIONSHIP": "Championship",
    "INITIAL_ROUND": "Initial round",
    "NUM_MEMBERS": "Members",
    "PASSWORD": "Access password",
    "PASSWORD_PLACEHOLDER": "Enter league password",
    "JOIN_BUTTON": "Join",
    "CANCEL_BUTTON": "Cancel"
  },
  "SUSPENSIONS": {
    "TITLE": "Manage Suspensions",
    "NEW_ROUND": "New round",
    "NEW_ROUND_PLACEHOLDER": "New round",
    "NO_SUSPENSIONS": "No suspensions defined"
  },
  "PLAY": {
    "CONFIRM_CHANGE_TITLE": "Confirm change",
    "CONFIRM_CHANGE_MESSAGE": "Are you sure you want to change this assignment even if the round has started?",
    "SELECT_TEAM": "Select team",
    "SELECT_PLAYER": "Select player",
    "CONFIRM_SELECTION": "Confirm selection",
    "PLAY_BUTTON": "Play",
    "STATISTICS": "Statistics",
    "NO_TEAMS_FOUND": "No teams found",
    "NO_PLAYS_AVAILABLE": "Unfortunately you have no plays available",
    "SUCCESS_MESSAGES": {
      "1": "Great choice! 🔥",
      "2": "Perfect! You nailed it! 🎯",
      "3": "Awesome! Winning selection! 💪"
    }
  },
  "INVITE_USERS": {
    "TITLE": "Invite Users to",
    "INSTRUCTIONS": "Enter the email addresses of the users you want to invite:",
    "EMAIL_PLACEHOLDER": "Enter email address (e.g. user@example.com)",
    "ADD_EMAIL": "Add email address to list",
    "SUCCESS": "Invites sent successfully!"
  },
  "TERMS": {
    "TITLE": "Terms and Conditions of Use",
    "SUBTITLE": "Survivor",
    "SECTION_1_TITLE": "1. Service Purpose",
    "SECTION_1_TEXT": "Survivor is a digital entertainment platform that allows users to participate in games and tournaments based on sports choices and competitive dynamics. The service does not constitute gambling or betting activities.",
    "SECTION_2_TITLE": "2. Registration and Account",
    "SECTION_2_P1": "To use Survivor, you must create an account via email address. The user is responsible for the accuracy of the information provided and the use of their account.",
    "SECTION_2_P2": "Only one account per user is allowed. Creating multiple accounts or using automated systems is prohibited.",
    "SECTION_3_TITLE": "3. Service Usage",
    "SECTION_3_TEXT": "The user agrees to use Survivor correctly and in accordance with these terms. Behaviors that may compromise the proper functioning of the platform are prohibited, including attempts to manipulate results or rankings.",
    "SECTION_4_TITLE": "4. Game Rules",
    "SECTION_4_TEXT": "The rules of games and tournaments are defined within the app and may be changed at any time. Results generated by the platform are considered final and non-contestable.",
    "SECTION_5_TITLE": "5. Prizes",
    "SECTION_5_TEXT": "Survivor does not provide real money prizes. Any prizes, awards, or trophies have exclusively symbolic or promotional value.",
    "SECTION_6_TITLE": "6. Account Suspension and Closure",
    "SECTION_6_TEXT": "The manager reserves the right to suspend or close a user's account, without notice, in case of violation of these terms or improper use of the service.",
    "SECTION_7_TITLE": "7. Limitation of Liability",
    "SECTION_7_P1": "The service is provided \"as is\". The manager does not guarantee the absence of errors, interruptions, or malfunctions and is not responsible for any damage resulting from the use of the platform.",
    "SECTION_7_P2": "The manager is not responsible for any inaccuracies in sports data provided by external sources.",
    "SECTION_8_TITLE": "8. Intellectual Property",
    "SECTION_8_TEXT": "All content on Survivor, including text, graphics, logos, and platform structure, is owned by the manager and may not be used without authorization.",
    "SECTION_9_TITLE": "9. Changes to Terms",
    "SECTION_9_TEXT": "These Terms and Conditions may be updated or modified at any time. Changes will be effective from their publication on the platform.",
    "SECTION_10_TITLE": "10. Applicable Law and Jurisdiction",
    "SECTION_10_TEXT": "These Terms and Conditions are governed by Italian law. For any dispute, the court of the manager's residence or registered office has exclusive jurisdiction.",
    "SECTION_11_TITLE": "11. Contact",
    "SECTION_11_TEXT": "For information or requests, you can contact the manager at the email address:"
  },
  "FAQ": {
    "TITLE": "FAQ - Frequently Asked Questions",
    "Q1": "What is Survivor?",
    "A1": "Survivor is an elimination game based on football matches. Each round you choose a team: if it wins, you stay in the game; if it loses or draws (according to the rules), you are eliminated.",
    "Q2": "How do I participate?",
    "A2": "To participate, you must be added to a group, accept the rules, and submit your choice within the deadline for the round.",
    "Q3": "How do I choose the team?",
    "A3": "You can choose a team from those playing in the available round. The choice must be made before the deadline indicated in the app.",
    "Q4": "Can I choose the same team multiple times?",
    "A4": "No. Each team can only be chosen once throughout the competition, unless otherwise specified in the league's specific rules.",
    "Q5": "What happens if I forget to choose?",
    "A5": "If you don't submit your choice within the established deadline, you will be automatically eliminated from the competition.",
    "Q6": "When is the choice considered valid?",
    "A6": "The choice is valid only if made correctly before the deadline and confirmed by the app.",
    "Q7": "What happens in case of postponement or suspension of a match?",
    "A7": "In case of postponement or suspension, the rules indicated in the official competition rules apply (e.g., match cancelled, choice to be redone, or result valid only if completed).",
    "Q8": "Does a draw eliminate?",
    "A8": "It depends on the competition format. In some modes a draw equals elimination, in others not. Always refer to the active rules.",
    "Q9": "How are results communicated?",
    "A9": "Results are automatically updated in the app at the end of official matches.",
    "Q10": "Can I change my choice?",
    "A10": "Yes, you can change your choice until the round deadline. After closing, it will no longer be possible to modify it.",
    "Q11": "What happens if multiple players win Survivor?",
    "A11": "If multiple players remain without eliminations until the end of the calendar, the winner (or winners) is determined according to league rules (e.g., playoff, shared prize, extra round).",
    "Q12": "Are there prizes?",
    "A12": "Any prizes depend on the league or game group. The app manages the game but is not responsible for prize management.",
    "Q13": "Is Survivor a betting app?",
    "A13": "No. Survivor is a recreational game based on predictions, without gambling purposes.",
    "Q14": "Is my data safe?",
    "A14": "Yes. Personal data is processed in compliance with current privacy regulations and used only for app functionality.",
    "Q15": "Can I participate in multiple Survivors simultaneously?",
    "A15": "Yes, you can participate in multiple competitions if enabled by the organizer.",
    "Q16": "Who can I contact for assistance?",
    "A16": "For technical problems or questions, use the Contact section in the app or write to"
  },
  "PRIVACY": {
    "TITLE": "Privacy Policy",
    "SUBTITLE": "Survivor",
    "INTRO": "This Privacy Policy describes how personal data of users using the Survivor platform (hereinafter \"Service\") is collected, used and protected, in accordance with EU Regulation 2016/679 (GDPR).",
    "SECTION_1_TITLE": "1. Data Controller",
    "SECTION_1_P1": "The data controller is the manager of the Survivor platform.",
    "SECTION_1_P2": "For any request regarding this Privacy Policy, you can contact the controller at the email address:",
    "SECTION_2_TITLE": "2. Personal Data Collected",
    "SECTION_2_INTRO": "Personal data collected through the use of the Service is limited to what is strictly necessary for its operation:",
    "SECTION_2_L1": "Email address (used for authentication via magic link)",
    "SECTION_2_L2": "User-chosen nickname",
    "SECTION_2_L3": "Sports preference (favorite team)",
    "SECTION_2_L4": "Technical data on Service usage (logs, device and access information)",
    "SECTION_3_TITLE": "3. Purpose of Processing",
    "SECTION_3_INTRO": "Personal data is processed for the following purposes:",
    "SECTION_3_L1": "Allow registration and access to the Service",
    "SECTION_3_L2": "Enable participation in games and tournaments",
    "SECTION_3_L3": "Manage platform features and rankings",
    "SECTION_3_L4": "Ensure security and proper functioning of the Service",
    "SECTION_3_L5": "Comply with any legal obligations",
    "SECTION_4_TITLE": "4. Legal Basis for Processing",
    "SECTION_4_INTRO": "The processing of personal data is carried out on the basis of:",
    "SECTION_4_L1": "Performance of the contract to which the user is a party (use of the Service)",
    "SECTION_4_L2": "Legitimate interest of the controller in security and platform improvement",
    "SECTION_5_TITLE": "5. Processing Methods",
    "SECTION_5_P1": "Data processing is carried out using IT and telematic tools, in compliance with the principles of lawfulness, fairness, transparency and data minimization.",
    "SECTION_5_P2": "Adequate security measures are adopted to protect personal data from unauthorized access, loss or unlawful use.",
    "SECTION_6_TITLE": "6. Data Retention",
    "SECTION_6_P1": "Personal data is retained for the time necessary to provide the Service.",
    "SECTION_6_P2": "The user can at any time request the deletion of their account and associated data.",
    "SECTION_7_TITLE": "7. Data Communication and Disclosure",
    "SECTION_7_P1": "Personal data is not sold or transferred to third parties.",
    "SECTION_7_P2": "Data may be processed by technical service providers (e.g., hosting or email services) exclusively for purposes related to the operation of the Service.",
    "SECTION_8_TITLE": "8. Aggregated and Anonymous Data",
    "SECTION_8_P1": "The controller may process data in aggregated and anonymous form for statistical purposes and analysis of platform usage.",
    "SECTION_8_P2": "Such data does not allow user identification in any way.",
    "SECTION_9_TITLE": "9. User Rights",
    "SECTION_9_INTRO": "The user has the right to:",
    "SECTION_9_L1": "Access their personal data",
    "SECTION_9_L2": "Request rectification or deletion",
    "SECTION_9_L3": "Object to or limit processing, in cases provided by law",
    "SECTION_9_P": "Requests can be sent to the email address:",
    "SECTION_10_TITLE": "10. Minors",
    "SECTION_10_P1": "The Service is reserved for users who are at least 14 years old.",
    "SECTION_10_P2": "By registering, the user declares to meet the required age requirements.",
    "SECTION_11_TITLE": "11. Cookies",
    "SECTION_11_P1": "The web app may use technical cookies necessary for the proper functioning of the Service.",
    "SECTION_11_P2": "Profiling cookies are not used without user consent.",
    "SECTION_12_TITLE": "12. Changes to Privacy Policy",
    "SECTION_12_P1": "This Privacy Policy may be updated at any time.",
    "SECTION_12_P2": "Changes will be effective from their publication on the platform."
  }
}
